namespace MyUI {
	/**
	 * 弹窗子界面接口
	 */
	export interface IWindowPart extends Laya.Component {

		///////////////////////////////////////////////////////////////////////////
		/// 如果子界面是包含多页签的，则把下面注释掉的字段复制到子界面中，子界面在打开
		/// 的时候会把该子界面要显示的页签赋值到willOpenWinId字段里 </br>
		/// 可以参考"福利-每日福利（DailyWelfarePart）"界面的实现
		///////////////////////////////////////////////////////////////////////////

		// /** 
		//  * 用来确定将要显示的子窗口 </br>
		//  * 注意：该值只是用来确认打开窗口时显示哪个子窗口，当子窗口打开后该值就失效了
		//  */
		// public willOpenWinId: WindowID = WindowID.Invalid;

		/** 
		 * 进入子界面，该方法在窗口切换到该子界面页签的时候会调用
		 */
		enterPart();
	}
}